Catalogs/КлассификаторЕдиницИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КлассификаторЕдиницИзмерения</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЭСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/узп_КоэффициентыПересчетаЕдиницИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>узп_КоэффициентыПересчетаЕдиницИзмерения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоэффициентПересчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсходнаяЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_ЕдиницыИзмеренияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ПлановаяНоменклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РезультирующаяЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_ЕдиницыИзмеренияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КлассификаторЕдиницИзмерения/Forms/УправляемаяФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КоэффициентыПересчетаЕдиницИзмерения.Номенклатура,
			|	КоэффициентыПересчетаЕдиницИзмерения.РезультирующаяЕдиницаИзмерения,
			|	КоэффициентыПересчетаЕдиницИзмерения.КоэффициентПересчета
			|ИЗ
			|	РегистрСведений.узп_КоэффициентыПересчетаЕдиницИзмерения КАК КоэффициентыПересчетаЕдиницИзмерения
			|ГДЕ
			|	КоэффициентыПересчетаЕдиницИзмерения.ИсходнаяЕдиницаИзмерения = &ИсходнаяЕдиницаИзмерения";
		Запрос.УстановитьПараметр("ИсходнаяЕдиницаИзмерения", Объект.Ссылка);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НС = ПересчетВДругие.Добавить();
			ЗаполнитьЗначенияСвойств(НС,Выборка);
		КонецЦикла;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КоэффициентыПересчетаЕдиницИзмерения.Номенклатура,
			|	КоэффициентыПересчетаЕдиницИзмерения.ИсходнаяЕдиницаИзмерения,
			|	КоэффициентыПересчетаЕдиницИзмерения.КоэффициентПересчета
			|ИЗ
			|	РегистрСведений.узп_КоэффициентыПересчетаЕдиницИзмерения КАК КоэффициентыПересчетаЕдиницИзмерения
			|ГДЕ
			|	КоэффициентыПересчетаЕдиницИзмерения.РезультирующаяЕдиницаИзмерения = &ИсходнаяЕдиницаИзмерения";
		Запрос.УстановитьПараметр("ИсходнаяЕдиницаИзмерения", Объект.Ссылка);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НС = ПересчетИзДругих.Добавить();
			ЗаполнитьЗначенияСвойств(НС,Выборка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого СтрокаПересчет Из ПересчетВДругие Цикл
		Если СтрокаПересчет.РезультирующаяЕдиницаИзмерения.Пустая() Тогда
			Сообщить("В строке №"+Строка(СтрокаПересчет.НомерСтроки)+" поля ""Пересчет в другие единицы измерения"" не выбрана результирующая единица измерения!",СтатусСообщения.Важное);
			Отказ = Истина;
		ИначеЕсли СтрокаПересчет.КоэффициентПересчета=0 Тогда
			Сообщить("В строке №"+Строка(СтрокаПересчет.НомерСтроки)+" поля ""Пересчет в другие единицы измерения"" не указан коэффициент пересчета!",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаПересчет Из ПересчетИзДругих Цикл
		Если СтрокаПересчет.ИсходнаяЕдиницаИзмерения.Пустая() Тогда
			Сообщить("В строке №"+Строка(СтрокаПересчет.НомерСтроки)+" поля ""Пересчет из других единицы измерения"" не выбрана исходная единица измерения!",СтатусСообщения.Важное);
			Отказ = Истина;
		ИначеЕсли СтрокаПересчет.КоэффициентПересчета=0 Тогда
			Сообщить("В строке №"+Строка(СтрокаПересчет.НомерСтроки)+" поля ""Пересчет из других единицы измерения"" не указан коэффициент пересчета!",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Код") Тогда
		Объект.Код = Параметры.Код;
	КонецЕсли;
	Если Параметры.Свойство("Наименование") Тогда
		Объект.Наименование = Параметры.Наименование;
	КонецЕсли;
	Если Параметры.Свойство("НаименованиеПолное") Тогда
		Объект.НаименованиеПолное = Параметры.НаименованиеПолное;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	НаборЗаписей = РегистрыСведений.узп_КоэффициентыПересчетаЕдиницИзмерения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИсходнаяЕдиницаИзмерения.Установить(Объект.Ссылка);
	НаборЗаписей.Очистить();
	Для Каждого СтрокаПересчет Из ПересчетВДругие Цикл
		НЗ = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НЗ,СтрокаПересчет);
		НЗ.ИсходнаяЕдиницаИзмерения = Объект.Ссылка;
	КонецЦикла;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Сообщить("Не удалось записать коэффициенты пересчета в другие единицы измерения по причине: "+ОписаниеОшибки());
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	НаборЗаписей = РегистрыСведений.узп_КоэффициентыПересчетаЕдиницИзмерения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РезультирующаяЕдиницаИзмерения.Установить(Объект.Ссылка);
	НаборЗаписей.Очистить();
	Для Каждого СтрокаПересчет Из ПересчетИзДругих Цикл
		НЗ = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НЗ,СтрокаПересчет);
		НЗ.РезультирующаяЕдиницаИзмерения = Объект.Ссылка;
	КонецЦикла;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Сообщить("Не уадлось записать коэффициенты пересчета из других единиц измерения по причине: "+ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;
		

КонецПроцедуры
